; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-34)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 29 of 34
2. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 29 of 34
3. (pick ball28 room4 left)
   deleted: (at ball28 room4) (free left)
   added: (carry ball28 left)
   goals met: 29 of 34
4. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 29 of 34
5. (drop ball28 room3 left)
   deleted: (carry ball28 left)
   added: (at ball28 room3) (free left)
   goals met: 30 of 34
6. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 30 of 34
7. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 30 of 34
8. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 31 of 34
9. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 31 of 34
10. (pick ball27 room4 left)
   deleted: (at ball27 room4) (free left)
   added: (carry ball27 left)
   goals met: 31 of 34
11. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 31 of 34
12. (drop ball27 room3 left)
   deleted: (carry ball27 left)
   added: (at ball27 room3) (free left)
   goals met: 32 of 34
13. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 32 of 34
14. (pick ball26 room4 left)
   deleted: (at ball26 room4) (free left)
   added: (carry ball26 left)
   goals met: 32 of 34
15. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 32 of 34
16. (drop ball26 room3 left)
   deleted: (carry ball26 left)
   added: (at ball26 room3) (free left)
   goals met: 33 of 34
17. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 33 of 34
18. (pick ball25 room4 left)
   deleted: (at ball25 room4) (free left)
   added: (carry ball25 left)
   goals met: 33 of 34
19. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 33 of 34
20. (drop ball25 room3 left)
   deleted: (carry ball25 left)
   added: (at ball25 room3) (free left)
   goals met: 34 of 34
